RTDWebAPI/Protos/.proto

<?xml version='1.0' encoding='UTF-8'?>
<wsdl:definitions xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:plink="http://schemas.xmlsoap.org/ws/2003/05/partner-link/" xmlns:wsdlsoap11="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdlsoap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap11enc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap11env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap12env="http://www.w3.org/2003/05/soap-envelope" xmlns:soap12enc="http://www.w3.org/2003/05/soap-encoding" xmlns:wsa="http://schemas.xmlsoap.org/ws/2003/03/addressing" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:tns="spyne.examples.hello.soap" targetNamespace="spyne.examples.hello.soap" name="Application"><wsdl:types><xs:schema targetNamespace="spyne.examples.hello.soap" elementFormDefault="qualified"><xs:complexType name="ERackStatus"><xs:sequence><xs:element name="ERackStatus_json_string" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="ERackStatusResponse"><xs:sequence><xs:element name="ERackStatusResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="stringArray"><xs:sequence><xs:element name="string" type="xs:string" minOccurs="0" maxOccurs="unbounded" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="agvAlarmMail"><xs:sequence><xs:element name="agvAlarmMail_json_string" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="agvAlarmMailResponse"><xs:sequence><xs:element name="agvAlarmMailResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="alarmMessage"><xs:sequence><xs:element name="alarmMessage_json_string" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="alarmMessageResponse"><xs:sequence><xs:element name="alarmMessageResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="checkEntityHavePlan"><xs:sequence><xs:element name="checkEntityHavePlan_json_string" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="checkEntityHavePlanResponse"><xs:sequence><xs:element name="checkEntityHavePlanResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="checkPlanInfo"><xs:sequence><xs:element name="checkPlanInfo_json_string" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="checkPlanInfoResponse"><xs:sequence><xs:element name="checkPlanInfoResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="getAutoEntity"><xs:sequence><xs:element name="getAutoEntity_json_string" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="getAutoEntityResponse"><xs:sequence><xs:element name="getAutoEntityResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="getPlanInfo"><xs:sequence><xs:element name="getPlanInfo_json_string" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="getPlanInfoResponse"><xs:sequence><xs:element name="getPlanInfoResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="reportAlive"><xs:sequence><xs:element name="reportAlive_json_string" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="reportAliveResponse"><xs:sequence><xs:element name="reportAliveResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="reportDispatchInfo"><xs:sequence><xs:element name="reportDispatchInfo_json_string" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="reportDispatchInfoResponse"><xs:sequence><xs:element name="reportDispatchInfoResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="say_hello"><xs:sequence><xs:element name="name" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="times" type="xs:integer" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="switchACSStatus"><xs:sequence><xs:element name="switchACSStatus_json_string" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="switchACSStatusResponse"><xs:sequence><xs:element name="switchACSStatusResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="taskStatus"><xs:sequence><xs:element name="taskStatus_json_string" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="taskStatusResponse"><xs:sequence><xs:element name="taskStatusResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="say_helloResponse"><xs:sequence><xs:element name="say_helloResult" type="tns:stringArray" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:element name="ERackStatus" type="tns:ERackStatus"/><xs:element name="ERackStatusResponse" type="tns:ERackStatusResponse"/><xs:element name="stringArray" type="tns:stringArray"/><xs:element name="agvAlarmMail" type="tns:agvAlarmMail"/><xs:element name="agvAlarmMailResponse" type="tns:agvAlarmMailResponse"/><xs:element name="alarmMessage" type="tns:alarmMessage"/><xs:element name="alarmMessageResponse" type="tns:alarmMessageResponse"/><xs:element name="checkEntityHavePlan" type="tns:checkEntityHavePlan"/><xs:element name="checkEntityHavePlanResponse" type="tns:checkEntityHavePlanResponse"/><xs:element name="checkPlanInfo" type="tns:checkPlanInfo"/><xs:element name="checkPlanInfoResponse" type="tns:checkPlanInfoResponse"/><xs:element name="getAutoEntity" type="tns:getAutoEntity"/><xs:element name="getAutoEntityResponse" type="tns:getAutoEntityResponse"/><xs:element name="getPlanInfo" type="tns:getPlanInfo"/><xs:element name="getPlanInfoResponse" type="tns:getPlanInfoResponse"/><xs:element name="reportAlive" type="tns:reportAlive"/><xs:element name="reportAliveResponse" type="tns:reportAliveResponse"/><xs:element name="reportDispatchInfo" type="tns:reportDispatchInfo"/><xs:element name="reportDispatchInfoResponse" type="tns:reportDispatchInfoResponse"/><xs:element name="say_hello" type="tns:say_hello"/><xs:element name="switchACSStatus" type="tns:switchACSStatus"/><xs:element name="switchACSStatusResponse" type="tns:switchACSStatusResponse"/><xs:element name="taskStatus" type="tns:taskStatus"/><xs:element name="taskStatusResponse" type="tns:taskStatusResponse"/><xs:element name="say_helloResponse" type="tns:say_helloResponse"/></xs:schema></wsdl:types><wsdl:message name="say_hello"><wsdl:part name="say_hello" element="tns:say_hello"/></wsdl:message><wsdl:message name="say_helloResponse"><wsdl:part name="say_helloResponse" element="tns:say_helloResponse"/></wsdl:message><wsdl:message name="reportAlive"><wsdl:part name="reportAlive" element="tns:reportAlive"/></wsdl:message><wsdl:message name="reportAliveResponse"><wsdl:part name="reportAliveResponse" element="tns:reportAliveResponse"/></wsdl:message><wsdl:message name="switchACSStatus"><wsdl:part name="switchACSStatus" element="tns:switchACSStatus"/></wsdl:message><wsdl:message name="switchACSStatusResponse"><wsdl:part name="switchACSStatusResponse" element="tns:switchACSStatusResponse"/></wsdl:message><wsdl:message name="agvAlarmMail"><wsdl:part name="agvAlarmMail" element="tns:agvAlarmMail"/></wsdl:message><wsdl:message name="agvAlarmMailResponse"><wsdl:part name="agvAlarmMailResponse" element="tns:agvAlarmMailResponse"/></wsdl:message><wsdl:message name="taskStatus"><wsdl:part name="taskStatus" element="tns:taskStatus"/></wsdl:message><wsdl:message name="taskStatusResponse"><wsdl:part name="taskStatusResponse" element="tns:taskStatusResponse"/></wsdl:message><wsdl:message name="getPlanInfo"><wsdl:part name="getPlanInfo" element="tns:getPlanInfo"/></wsdl:message><wsdl:message name="getPlanInfoResponse"><wsdl:part name="getPlanInfoResponse" element="tns:getPlanInfoResponse"/></wsdl:message><wsdl:message name="checkPlanInfo"><wsdl:part name="checkPlanInfo" element="tns:checkPlanInfo"/></wsdl:message><wsdl:message name="checkPlanInfoResponse"><wsdl:part name="checkPlanInfoResponse" element="tns:checkPlanInfoResponse"/></wsdl:message><wsdl:message name="ERackStatus"><wsdl:part name="ERackStatus" element="tns:ERackStatus"/></wsdl:message><wsdl:message name="ERackStatusResponse"><wsdl:part name="ERackStatusResponse" element="tns:ERackStatusResponse"/></wsdl:message><wsdl:message name="reportDispatchInfo"><wsdl:part name="reportDispatchInfo" element="tns:reportDispatchInfo"/></wsdl:message><wsdl:message name="reportDispatchInfoResponse"><wsdl:part name="reportDispatchInfoResponse" element="tns:reportDispatchInfoResponse"/></wsdl:message><wsdl:message name="alarmMessage"><wsdl:part name="alarmMessage" element="tns:alarmMessage"/></wsdl:message><wsdl:message name="alarmMessageResponse"><wsdl:part name="alarmMessageResponse" element="tns:alarmMessageResponse"/></wsdl:message><wsdl:message name="getAutoEntity"><wsdl:part name="getAutoEntity" element="tns:getAutoEntity"/></wsdl:message><wsdl:message name="getAutoEntityResponse"><wsdl:part name="getAutoEntityResponse" element="tns:getAutoEntityResponse"/></wsdl:message><wsdl:message name="checkEntityHavePlan"><wsdl:part name="checkEntityHavePlan" element="tns:checkEntityHavePlan"/></wsdl:message><wsdl:message name="checkEntityHavePlanResponse"><wsdl:part name="checkEntityHavePlanResponse" element="tns:checkEntityHavePlanResponse"/></wsdl:message><wsdl:service name="ACSWebService"><wsdl:port name="Application" binding="tns:Application"><wsdlsoap11:address location="http://192.168.0.84:8089/"/></wsdl:port></wsdl:service><wsdl:portType name="Application"><wsdl:operation name="say_hello" parameterOrder="say_hello"><wsdl:documentation>Docstrings for service methods appear as documentation in the wsdl.
        &lt;b&gt;What fun!&lt;/b&gt;
        @param name: the name to say hello to
        @param times: the number of times to say hello
        @return  When returning an iterable, you can use any type of python iterable. Here, we chose to use generators.
        </wsdl:documentation><wsdl:input name="say_hello" message="tns:say_hello"/><wsdl:output name="say_helloResponse" message="tns:say_helloResponse"/></wsdl:operation><wsdl:operation name="reportAlive" parameterOrder="reportAlive"><wsdl:input name="reportAlive" message="tns:reportAlive"/><wsdl:output name="reportAliveResponse" message="tns:reportAliveResponse"/></wsdl:operation><wsdl:operation name="switchACSStatus" parameterOrder="switchACSStatus"><wsdl:input name="switchACSStatus" message="tns:switchACSStatus"/><wsdl:output name="switchACSStatusResponse" message="tns:switchACSStatusResponse"/></wsdl:operation><wsdl:operation name="agvAlarmMail" parameterOrder="agvAlarmMail"><wsdl:input name="agvAlarmMail" message="tns:agvAlarmMail"/><wsdl:output name="agvAlarmMailResponse" message="tns:agvAlarmMailResponse"/></wsdl:operation><wsdl:operation name="taskStatus" parameterOrder="taskStatus"><wsdl:input name="taskStatus" message="tns:taskStatus"/><wsdl:output name="taskStatusResponse" message="tns:taskStatusResponse"/></wsdl:operation><wsdl:operation name="getPlanInfo" parameterOrder="getPlanInfo"><wsdl:input name="getPlanInfo" message="tns:getPlanInfo"/><wsdl:output name="getPlanInfoResponse" message="tns:getPlanInfoResponse"/></wsdl:operation><wsdl:operation name="checkPlanInfo" parameterOrder="checkPlanInfo"><wsdl:input name="checkPlanInfo" message="tns:checkPlanInfo"/><wsdl:output name="checkPlanInfoResponse" message="tns:checkPlanInfoResponse"/></wsdl:operation><wsdl:operation name="ERackStatus" parameterOrder="ERackStatus"><wsdl:input name="ERackStatus" message="tns:ERackStatus"/><wsdl:output name="ERackStatusResponse" message="tns:ERackStatusResponse"/></wsdl:operation><wsdl:operation name="reportDispatchInfo" parameterOrder="reportDispatchInfo"><wsdl:input name="reportDispatchInfo" message="tns:reportDispatchInfo"/><wsdl:output name="reportDispatchInfoResponse" message="tns:reportDispatchInfoResponse"/></wsdl:operation><wsdl:operation name="alarmMessage" parameterOrder="alarmMessage"><wsdl:input name="alarmMessage" message="tns:alarmMessage"/><wsdl:output name="alarmMessageResponse" message="tns:alarmMessageResponse"/></wsdl:operation><wsdl:operation name="getAutoEntity" parameterOrder="getAutoEntity"><wsdl:input name="getAutoEntity" message="tns:getAutoEntity"/><wsdl:output name="getAutoEntityResponse" message="tns:getAutoEntityResponse"/></wsdl:operation><wsdl:operation name="checkEntityHavePlan" parameterOrder="checkEntityHavePlan"><wsdl:input name="checkEntityHavePlan" message="tns:checkEntityHavePlan"/><wsdl:output name="checkEntityHavePlanResponse" message="tns:checkEntityHavePlanResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="Application" type="tns:Application"><wsdlsoap11:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="say_hello"><wsdlsoap11:operation soapAction="say_hello" style="document"/><wsdl:input name="say_hello"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="say_helloResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="reportAlive"><wsdlsoap11:operation soapAction="reportAlive" style="document"/><wsdl:input name="reportAlive"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="reportAliveResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="switchACSStatus"><wsdlsoap11:operation soapAction="switchACSStatus" style="document"/><wsdl:input name="switchACSStatus"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="switchACSStatusResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="agvAlarmMail"><wsdlsoap11:operation soapAction="agvAlarmMail" style="document"/><wsdl:input name="agvAlarmMail"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="agvAlarmMailResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="taskStatus"><wsdlsoap11:operation soapAction="taskStatus" style="document"/><wsdl:input name="taskStatus"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="taskStatusResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="getPlanInfo"><wsdlsoap11:operation soapAction="getPlanInfo" style="document"/><wsdl:input name="getPlanInfo"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="getPlanInfoResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="checkPlanInfo"><wsdlsoap11:operation soapAction="checkPlanInfo" style="document"/><wsdl:input name="checkPlanInfo"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="checkPlanInfoResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="ERackStatus"><wsdlsoap11:operation soapAction="ERackStatus" style="document"/><wsdl:input name="ERackStatus"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="ERackStatusResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="reportDispatchInfo"><wsdlsoap11:operation soapAction="reportDispatchInfo" style="document"/><wsdl:input name="reportDispatchInfo"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="reportDispatchInfoResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="alarmMessage"><wsdlsoap11:operation soapAction="alarmMessage" style="document"/><wsdl:input name="alarmMessage"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="alarmMessageResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="getAutoEntity"><wsdlsoap11:operation soapAction="getAutoEntity" style="document"/><wsdl:input name="getAutoEntity"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="getAutoEntityResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="checkEntityHavePlan"><wsdlsoap11:operation soapAction="checkEntityHavePlan" style="document"/><wsdl:input name="checkEntityHavePlan"><wsdlsoap11:body use="literal"/></wsdl:input><wsdl:output name="checkEntityHavePlanResponse"><wsdlsoap11:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding></wsdl:definitions>